from colorama import Fore, Style, init

init(autoreset=True)

def show_banner():
    banner = f"""
{Fore.CYAN}
██╗  ██╗████████╗████████╗██████╗      ██████╗ ██╗
██║  ██║╚══██╔══╝╚══██╔══╝██╔══██╗     ██╔══██╗██║
███████║   ██║      ██║   ██████╔╝     ██████╔╝██║
██╔══██║   ██║      ██║   ██╔═══╝      ██╔══██╗██║
██║  ██║   ██║      ██║   ██║          ██║  ██║██║
╚═╝  ╚═╝   ╚═╝      ╚═╝   ╚═╝          ╚═╝  ╚═╝╚═╝

{Fore.YELLOW}        HTTP REQUEST INSPECTOR
{Fore.RED}              (HTTP.R.I)

{Fore.GREEN}[+] Network Request Analyzer
{Fore.GREEN}[+] Header Inspector
{Fore.GREEN}[+] Security Testing Tool
{Style.RESET_ALL}
"""
    print(banner)